{
  "admission": "Admissions are open from May to July. Apply through our official portal at https://aits-tpt.edu.in/admissions.",
  "fee structure": "B.Tech fees range from ₹70,000 to ₹75,000/year depending on the branch.",
  "hostel": "Yes, we have separate hostels for boys and girls with good amenities like Wi-Fi, mess, and laundry.",
  "placement": "AITS Tirupati records 90% placements with recruiters like Infosys, TCS, Wipro, HCL, and Tech Mahindra.",
  
  "scholarship": "Merit-based and government scholarships are available for eligible students.",
  "contact": "Contact us at +91-877-2244444 or email info@aits-tpt.edu.in.",
  "founder": "Sri C. Gangi Reddy is the Founder and Secretary of AITS Tirupati.",
  "chairman": "Sri C. Ram Mohan Reddy is the Chairman of AITS Tirupati.",
  "vision": "To be a premier institute imparting quality technical education and promoting innovation.",
  "mission": "Providing infrastructure, industry-institute interaction, and research activities for student development.",
  "affiliation": "AITS Tirupati is affiliated to JNTU Anantapur and approved by AICTE, New Delhi.",
  "accreditation": "NBA accredited in Tier-I mode and NAAC A+ grade accredited.",
  "location": "AITS Tirupati is located on Venkatapuram, Tirupati - Chennai Highway.",
  "library": "The central library has thousands of volumes, journals, and a digital section.",
  "training": "Regular training in aptitude, coding, and soft skills is provided by the placement cell.",
  "r&d": "AITS Tirupati has an active R&D cell to encourage innovation and projects.",
  "iqac": "The Internal Quality Assurance Cell monitors academic and administrative performance.",
  "anti-ragging": "AITS has a zero-tolerance policy towards ragging with active committees in place.",
  "proctorial system": "The proctor system assigns mentors to guide and track student progress.",
  "transport": "Buses operate on multiple routes in and around Tirupati for students and staff.",
  "canteen": "A hygienic canteen provides food and refreshments at subsidized rates.",
  "ncc": "NCC training is available to develop leadership and discipline.",
  "nss": "NSS students participate in community service, blood donation, and social work.",
  "sports": "Well-equipped sports facilities for cricket, basketball, volleyball, and indoor games.",
  "events": "Annual cultural and technical fests like 'AITSEEE' and 'VIBRANCE' are organized.",
  "faculty": "Experienced faculty members hold M.Tech/PhD degrees and guide students academically.",
  "internships": "Internship opportunities with reputed companies are facilitated through industry tie-ups.",
  "placements training": "Placement training starts from the second year covering communication and technical skills.",
  "labs": "Advanced labs are available in all departments with modern equipment and software.",
  "courses": "UG and PG programs in engineering, MBA, and diploma courses are offered.",
  "mba": "A 2-year MBA program with specializations in HR, Finance, and Marketing is available.",
  "mtech": "M.Tech programs in VLSI, CSE, and Structural Engineering are offered.",
  "civil dept": "The Civil Engineering department emphasizes infrastructure, design, and environmental engineering.",
  "cse dept": "CSE focuses on software engineering, AI, ML, and full-stack development.",
  "fest":"only education based activities taken place in our college",
  "ece dept": "ECE covers embedded systems, VLSI, and communication technologies.",
  "gym": "Our gym includes a Magnetic Cycle, 12 Station Gym, Smith Machine, Flat Bench, Bench Press, Plates, and Dumbbells.",
  "eee dept": "EEE department trains students in electrical systems, power electronics, and control systems.",
  "it dept": "Information Technology focuses on cloud computing, cybersecurity, and data analytics.",
  "mech dept": "Mechanical Engineering emphasizes thermal, CAD/CAM, and manufacturing.",
  "website": "Visit the official website at https://aits-tpt.edu.in for more information.",
  "gallery": "College photos and event highlights are available in the website gallery section.",
  "newsletter": "A quarterly newsletter highlights campus activities and achievements.",
  "blog": "Latest academic and tech-related blogs are shared under the college blog section.",
  "ai club": "The Artificial Intelligence club hosts hackathons, seminars, and workshops.",
  "ieee chapter": "AITS has an active IEEE student branch with annual events and competitions.",
  "startup cell": "Innovation and Entrepreneurship Development Cell (IEDC) supports student startups.",
  "career guidance": "Career guidance sessions and counseling are conducted every semester.",
  "alumni": "Alumni from AITS work in MNCs and regularly interact through alumni meets.",
  "ranking": "AITS is ranked among the top engineering colleges in Andhra Pradesh.",
  "industrial visits": "Departments organize regular industrial visits to companies and research labs.",
  "social media": "Follow AITS on Facebook, Twitter, and Instagram for updates and announcements.",
    "departments": {
      "Computer Science and Engineering": "180 seats",
      "Electronics and Communication Engineering": "180 seats",
      "Electrical and Electronics Engineering": "120 seats",
      "Mechanical Engineering": "100 seats",
      "Civil Engineering": "120 seats",
      "Artificial Intelligence and Machine Learning": "100 seats",
      "Artificial Intelligence and Data Science": "100 seats",
      "CSE Data Science (CDS)": "80 seats",
      "IoT and Cyber Security including Blockchain Technology": "80 seats",
      "Humanities and Basic Sciences": "No specific intake - supports all departments",
      "Master of Business Administration (MBA)": "120 seats"
    },
    "total_departments": "11 departments including core engineering, interdisciplinary, and management."
  
  
}